{
    "nav.features": "Функції",
    "nav.how_it_works": "Як це працює",
    "nav.get_started": "Почати",
    
    "hero.title": "Безкомпромісний Захищений Чат",
    "hero.description": "OpenChat – це платформа для безпечного обміну повідомленнями з наскрізним шифруванням. Ніякого номера телефону, децентралізовано за дизайном і повністю з відкритим кодом. Ідеально для тих, хто дбає про свою приватність – з невеликим гумористичним відтінком!",
    "hero.button.get_started": "Почати",
    "hero.button.learn_more": "Дізнатися більше",
    
    "features.section_title": "Чому варто обрати OpenChat?",
    "features.section_description": "Відчуйте майбутнє безпечного обміну повідомленнями з функціями, створеними для захисту вашої приватності та покращення спілкування – з легким, веселим підходом!",
    
    "features.e2ee.title": "Наскрізне Шифрування",
    "features.e2ee.description": "Усі повідомлення шифруються сучасними протоколами, гарантуючи, що їх можуть прочитати лише ви та ваш одержувач. Справжній цифровий сейф!",
    
    "features.no_phone.title": "Немає Необхідності в Номері Телефону",
    "features.no_phone.description": "Реєструйтеся, не надаючи номер телефону, зберігаючи вашу приватність і роблячи сервіс доступним для кожного.",
    
    "features.decentralized.title": "Децентралізована Архітектура",
    "features.decentralized.description": "Базується на взаємопов’язаних базах даних, розміщених користувачами в хмарі, створюючи стійку мережу, яку не так легко зламати – як справжня цифрова фортеця!",
    
    "features.open_source.title": "Відкритий Код",
    "features.open_source.description": "Повністю прозорий код, який може перевірити, змінити та вдосконалити будь-хто. Без прихованих лазів – лише чесність і прозорість!",
    
    "features.european.title": "Європейський за Дизайном",
    "features.european.description": "OpenChat виготовлений на 100 % в Європі, з європейськими цінностями приватності в основі. Відповідає GDPR та без типового спостереження Силіконової долини!",
    
    "how_it_works.section_title": "Як Працює OpenChat",
    "how_it_works.section_description": "Дізнайтеся про технології, що стоять за безпечною та децентралізованою платформою OpenChat. Справжнє цифрове диво!",
    
    "how_it_works.step1.title": "Децентралізована Мережа Баз Даних",
    "how_it_works.step1.description": "OpenChat з’єднує розподілені бази даних, розміщені користувачами в хмарі. На відміну від централізованих додатків, він створює мережу взаємопов’язаних вузлів, кожен з яких зберігає зашифровані дані. Таким чином, немає єдиної точки відмови або центрального органу, що контролює ваші розмови.",
    
    "how_it_works.step2.title": "Наскрізне Шифрування",
    "how_it_works.step2.description": "Усі повідомлення шифруються на вашому пристрої перед відправкою і можуть бути розшифровані лише отримувачем. Навіть якщо дані перехоплять, буде видно лише набір незрозумілих символів!",
    
    "how_it_works.step3.title": "Ідентичність Без Номера Телефону",
    "how_it_works.step3.description": "На відміну від інших додатків, OpenChat не вимагає номера телефону для створення облікового запису. Це захищає вашу приватність і робить сервіс доступним для кожного з інтернет-з’єднання, завдяки безпечним криптографічним ключам.",
    
    "how_it_works.step4.title": "Розробка з Відкритим Кодом",
    "how_it_works.step4.description": "Код OpenChat є повністю відкритим, що дозволяє кожному перевірити його, впевнитися в його безпеці та внести покращення. Такий спільний підхід гарантує, що платформа завжди залишається захищеною та актуальною!",
    
    "cta.section_title": "Готові Почати?",
    "cta.section_description": "Приєднуйтеся до революції безпечного обміну повідомленнями вже сьогодні. Розгорніть власну інстанцію OpenChat або дізнайтеся більше про його роботу.",
    "cta.button.deploy": "Розгорнути з Railway",
    "cta.button.documentation": "Читати документацію",
    
    "footer.links.features": "Функції",
    "footer.links.how_it_works": "Як це працює",
    "footer.links.github": "GitHub",
    "footer.links.get_started": "Почати",
    
    "footer.copyright": "© 2025 OpenChat. Всі права захищено. Open source безпечний чат для всіх.",
    
    "railway.title": "Посібник з розгортання шаблонів Railway",
    "railway.subtitle": "Запустіть свій власний OpenChat, не втрачаючи здорового глузду! Не хвилюйтеся, якщо ви ніколи не розгортали нічого більш вишуканого, ніж твіт – цей посібник зробить з вас майстра розгортання швидше, ніж ви зможете сказати \"де кнопка скасування?\"",
    
    "railway.step1.title": "Зареєструйтеся на Railway",
    "railway.step1.intro": "Спочатку вам потрібно створити обліковий запис на Railway:",
    "railway.step1.list.item1": "Натисніть кнопку \"Deploy on Railway\" в кінці цього посібника.",
    "railway.step1.list.item2": "На сторінці Railway натисніть \"Sign Up\" у верхньому правому куті.",
    "railway.step1.list.item3": "Обирайте \"Continue with Email\" з варіантів.",
    "railway.step1.list.item4": "Потім натисніть \"Continue with Google\", щоб зареєструватися за допомогою свого облікового запису Google.",
    "railway.step1.list.item5": "Завершіть процес автентифікації Google.",
    "railway.step1.joke": "Чому розробник залишився без грошей? Бо він витратив увесь свій кеш! Не хвилюйтеся, Railway має вдосталь кешу для вашого додатку.",
    "railway.step1.note": "<strong>Примітка:</strong> Railway вимагає облікового запису для розгортання шаблонів. Використання Google – найшвидший спосіб розпочати, якщо ви не використовуєте голубів-поштарів для електронної пошти.",
    
    "railway.step2.title": "Розгорніть шаблон",
    "railway.step2.intro": "Після входу в систему вас буде направлено на сторінку розгортання шаблону:",
    "railway.step2.list.item1": "Ознайомтеся з деталями шаблону та параметрами налаштування.",
    "railway.step2.list.item2": "Натисніть кнопку \"Deploy\", щоб розпочати процес розгортання.",
    "railway.step2.list.item3": "Railway запропонує вам створити новий проект, використовуючи цей шаблон.",
    "railway.step2.list.item4": "Налаштування за замовчуванням зазвичай достатні для більшості користувачів.",
    "railway.step2.joke": "Я сказав своєму комп’ютеру, що мені потрібна перерва від розгортання. Він запитав, чи спробував я вимкнутися та увімкнутися знову. Класичний ІТ-гумор!",
    "railway.step2.note": "<strong>Порада:</strong> Якщо вам потрібно налаштувати змінні оточення або інші параметри, зробіть це перед розгортанням. Тільки не називайте їх іменами своїх домашніх улюбленців – це ускладнює налагодження.",
    
    "railway.step3.title": "Зачекайте завершення розгортання",
    "railway.step3.intro": "Railway тепер ініціалізує та розгорне ваш проект:",
    "railway.step3.list.item1": "Ви побачите індикатор прогресу, що показує стан розгортання.",
    "railway.step3.list.item2": "Система надасть ресурси, встановить залежності та збере ваш додаток.",
    "railway.step3.list.item3": "Цей процес зазвичай займає 2-5 хвилин.",
    "railway.step3.list.item4": "Ви побачите зелену галочку (✓) після успішного розгортання.",
    "railway.step3.joke": "Індикатори прогресу розгортання схожі на їжу в мікрохвильовці – досягають 90% за лічені секунди, а решта 10% тривають вічність. Час брати каву!",
    "railway.step3.note": "<strong>Важливо:</strong> Не закривайте вкладку браузера під час розгортання. Процес продовжиться у фоновому режимі, але рівень вашої тривоги може зрости на 200%.",
    
    "railway.step4.title": "Знайдіть URL розгортання",
    "railway.step4.intro": "Після завершення розгортання ви зможете отримати доступ до свого додатку:",
    "railway.step4.list.item1": "Знайдіть розділ \"Deployments\" у панелі керування вашим проектом.",
    "railway.step4.list.item2": "Знайдіть останнє успішне розгортання.",
    "railway.step4.list.item3": "Натисніть на розгортання, щоб переглянути деталі.",
    "railway.step4.list.item4": "Знайдіть розділ \"Domains\", щоб дізнатися URL вашого додатку.",
    "railway.step4.list.item5": "URL виглядатиме приблизно так: https://назва-вашого-проекту.railway.app",
    "railway.step4.joke": "Ваш новий URL – це як перша адреса вашого додатку. Надішліть віртуальне запрошення на святкування нової оселі всім вашим друзям-розробникам!",
    "railway.step4.note": "<strong>Успіх:</strong> Ваш додаток тепер онлайн! Поділіться цим URL з іншими для доступу до вашого розгорнутого проекту. Не соромтеся потанцювати від радості – ми не будемо судити.",
    
    "railway.step5.title": "Контролюйте та керуйте своїм проектом",
    "railway.step5.intro": "Railway надає інструменти для контролю та керування вашим розгортанням:",
    "railway.step5.list.item1": "Використовуйте вкладку \"Metrics\" для перегляду використання ресурсів та продуктивності.",
    "railway.step5.list.item2": "Перевірте розділ \"Logs\" для усунення проблем.",
    "railway.step5.list.item3": "Ви можете вносити зміни до конфігурації свого проекту у розділі \"Variables\".",
    "railway.step5.list.item4": "Для розширених налаштувань дослідіть вкладку \"Settings\".",
    "railway.step5.joke": "Перегляд логів розгортання – це як реаліті-шоу для інженерів-програмістів. \"Ой, подивіться на ту помилку! Не можу повірити, що це сталося!\"",
    "railway.step5.note": "<strong>Примітка:</strong> Railway пропонує щедрий безкоштовний тариф, але для проектів з високими вимогами до ресурсів може знадобитися оновлення. Ваш додаток – як підліток, що росте: він може потребувати більше ресурсів, ніж ви спочатку думали.",
    
    "railway.deploy_button": "Розгорнути на Railway"
  }
  